## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cdn_frontdoor_custom_domain.static-web-app will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "static-web-app" {
      + cdn_frontdoor_profile_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/cdn-mjwmtasts"
      + dns_zone_id              = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/tfttest.matthewjwhite.co.uk"
      + expiration_date          = (known after apply)
      + host_name                = "tfttest.matthewjwhite.co.uk"
      + id                       = (known after apply)
      + name                     = "afd-cd-swa-test"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # azurerm_cdn_frontdoor_custom_domain_association.static-web-app will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "static-web-app" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = [
          + "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts/afdEndpoints/afd-ep-swa-test/routes/afd-rt-swa-test",
        ]
      + id                             = (known after apply)
    }

  # azurerm_cdn_frontdoor_route.static-web-app will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "static-web-app" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts/customDomains/tfttest-matthewjwhite-co-uk-4d1a",
        ] -> (known after apply)
        id                              = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/test-afd-mta-sts/afdEndpoints/afd-ep-swa-test/routes/afd-rt-swa-test"
        name                            = "afd-rt-swa-test"
        # (11 unchanged attributes hidden)
    }

  # module.tftest-records.azurerm_dns_a_record.a["@"] will be created
  + resource "azurerm_dns_a_record" "a" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.tftest-records.azurerm_dns_txt_record.txt["_dnsauth"] will be created
  + resource "azurerm_dns_txt_record" "txt" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"

      + record {
          + value = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>